#+TITLE: Box

Ubuntu 20.04 EC2 instance for managing things.

* Configs
** tmate & tmux
#+BEGIN_SRC shell :tangle ~/.tmate.conf
set -s escape-time 0
#+END_SRC
* Tools
  
Install misc tools:
#+begin_src shell
  sudo apt update

  sudo apt install -y unzip emacs-nox tmate
#+end_src

#+RESULTS:
#+BEGIN_example
Hit:1 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal InRelease
Hit:2 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-updates InRelease
Hit:3 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-backports InRelease
Get:4 http://security.ubuntu.com/ubuntu focal-security InRelease [107 kB]
Fetched 107 kB in 1s (77.2 kB/s)
Reading package lists...
Building dependency tree...
Reading state information...
16 packages can be upgraded. Run 'apt list --upgradable' to see them.
Reading package lists...
Building dependency tree...
Reading state information...
emacs-nox is already the newest version (1:26.3+1-1ubuntu2).
tmate is already the newest version (2.4.0-1).
Suggested packages:
  zip
The following NEW packages will be installed:
  unzip
0 upgraded, 1 newly installed, 0 to remove and 16 not upgraded.
Need to get 169 kB of archives.
After this operation, 593 kB of additional disk space will be used.
Get:1 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 unzip amd64 6.0-25ubuntu1 [169 kB]
Fetched 169 kB in 0s (9460 kB/s)
Selecting previously unselected package unzip.
(Reading database ... (Reading database ... 5%(Reading database ... 10%(Reading database ... 15%(Reading database ... 20%(Reading database ... 25%(Reading database ... 30%(Reading database ... 35%(Reading database ... 40%(Reading database ... 45%(Reading database ... 50%(Reading database ... 55%(Reading database ... 60%(Reading database ... 65%(Reading database ... 70%(Reading database ... 75%(Reading database ... 80%(Reading database ... 85%(Reading database ... 90%(Reading database ... 95%(Reading database ... 100%(Reading database ... 63662 files and directories currently installed.)
Preparing to unpack .../unzip_6.0-25ubuntu1_amd64.deb ...
Unpacking unzip (6.0-25ubuntu1) ...
Setting up unzip (6.0-25ubuntu1) ...
Processing triggers for mime-support (3.64ubuntu1) ...
Processing triggers for man-db (2.9.1-1) ...
#+END_example

Install docker:
#+begin_src shell
  sudo apt update

  sudo apt install -y \
     apt-transport-https \
     ca-certificates \
     curl \
     gnupg-agent \
     software-properties-common

  curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo apt-key add -

  sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/ubuntu $(lsb_release -cs) stable"
  sudo apt update
  sudo apt install -y docker-ce docker-ce-cli containerd.io
#+end_src

#+RESULTS:
#+BEGIN_example
Hit:1 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal InRelease
Hit:2 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-updates InRelease
Hit:3 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-backports InRelease
Hit:4 https://download.docker.com/linux/ubuntu focal InRelease
Get:5 http://security.ubuntu.com/ubuntu focal-security InRelease [107 kB]
Fetched 107 kB in 1s (73.4 kB/s)
Reading package lists...
Building dependency tree...
Reading state information...
14 packages can be upgraded. Run 'apt list --upgradable' to see them.
Reading package lists...
Building dependency tree...
Reading state information...
gnupg-agent is already the newest version (2.2.19-3ubuntu2).
ca-certificates is already the newest version (20190110ubuntu1.1).
curl is already the newest version (7.68.0-1ubuntu2.1).
software-properties-common is already the newest version (0.98.9.2).
apt-transport-https is already the newest version (2.0.2ubuntu0.1).
0 upgraded, 0 newly installed, 0 to remove and 14 not upgraded.
OK
Hit:1 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal InRelease
Hit:2 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-updates InRelease
Hit:3 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-backports InRelease
Hit:4 https://download.docker.com/linux/ubuntu focal InRelease
Hit:5 http://security.ubuntu.com/ubuntu focal-security InRelease
Reading package lists...
Hit:1 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal InRelease
Hit:2 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-updates InRelease
Hit:3 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-backports InRelease
Hit:4 https://download.docker.com/linux/ubuntu focal InRelease
Hit:5 http://security.ubuntu.com/ubuntu focal-security InRelease
Reading package lists...
Building dependency tree...
Reading state information...
14 packages can be upgraded. Run 'apt list --upgradable' to see them.
Reading package lists...
Building dependency tree...
Reading state information...
The following additional packages will be installed:
  aufs-tools cgroupfs-mount pigz
The following NEW packages will be installed:
  aufs-tools cgroupfs-mount containerd.io docker-ce docker-ce-cli pigz
0 upgraded, 6 newly installed, 0 to remove and 14 not upgraded.
Need to get 85.3 MB of archives.
After this operation, 381 MB of additional disk space will be used.
Get:1 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 pigz amd64 2.4-1 [57.4 kB]
Get:2 https://download.docker.com/linux/ubuntu focal/stable amd64 containerd.io amd64 1.2.13-2 [21.4 MB]
Get:3 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 aufs-tools amd64 1:4.14+20190211-1ubuntu1 [104 kB]
Get:4 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 cgroupfs-mount all 1.4 [6320 B]
Get:5 https://download.docker.com/linux/ubuntu focal/stable amd64 docker-ce-cli amd64 5:19.03.12~3-0~ubuntu-focal [41.2 MB]
Get:6 https://download.docker.com/linux/ubuntu focal/stable amd64 docker-ce amd64 5:19.03.12~3-0~ubuntu-focal [22.5 MB]
Fetched 85.3 MB in 2s (53.9 MB/s)
Selecting previously unselected package pigz.
(Reading database ... (Reading database ... 5%(Reading database ... 10%(Reading database ... 15%(Reading database ... 20%(Reading database ... 25%(Reading database ... 30%(Reading database ... 35%(Reading database ... 40%(Reading database ... 45%(Reading database ... 50%(Reading database ... 55%(Reading database ... 60%(Reading database ... 65%(Reading database ... 70%(Reading database ... 75%(Reading database ... 80%(Reading database ... 85%(Reading database ... 90%(Reading database ... 95%(Reading database ... 100%(Reading database ... 63688 files and directories currently installed.)
Preparing to unpack .../0-pigz_2.4-1_amd64.deb ...
Unpacking pigz (2.4-1) ...
Selecting previously unselected package aufs-tools.
Preparing to unpack .../1-aufs-tools_1%3a4.14+20190211-1ubuntu1_amd64.deb ...
Unpacking aufs-tools (1:4.14+20190211-1ubuntu1) ...
Selecting previously unselected package cgroupfs-mount.
Preparing to unpack .../2-cgroupfs-mount_1.4_all.deb ...
Unpacking cgroupfs-mount (1.4) ...
Selecting previously unselected package containerd.io.
Preparing to unpack .../3-containerd.io_1.2.13-2_amd64.deb ...
Unpacking containerd.io (1.2.13-2) ...
Selecting previously unselected package docker-ce-cli.
Preparing to unpack .../4-docker-ce-cli_5%3a19.03.12~3-0~ubuntu-focal_amd64.deb ...
Unpacking docker-ce-cli (5:19.03.12~3-0~ubuntu-focal) ...
Selecting previously unselected package docker-ce.
Preparing to unpack .../5-docker-ce_5%3a19.03.12~3-0~ubuntu-focal_amd64.deb ...
Unpacking docker-ce (5:19.03.12~3-0~ubuntu-focal) ...
Setting up aufs-tools (1:4.14+20190211-1ubuntu1) ...
Setting up containerd.io (1.2.13-2) ...
Created symlink /etc/systemd/system/multi-user.target.wants/containerd.service → /lib/systemd/system/containerd.service.
Setting up docker-ce-cli (5:19.03.12~3-0~ubuntu-focal) ...
Setting up pigz (2.4-1) ...
Setting up cgroupfs-mount (1.4) ...
Setting up docker-ce (5:19.03.12~3-0~ubuntu-focal) ...
Created symlink /etc/systemd/system/multi-user.target.wants/docker.service → /lib/systemd/system/docker.service.
Created symlink /etc/systemd/system/sockets.target.wants/docker.socket → /lib/systemd/system/docker.socket.
Processing triggers for systemd (245.4-4ubuntu3.2) ...
Processing triggers for man-db (2.9.1-1) ...
Processing triggers for libc-bin (2.31-0ubuntu9) ...
#+END_example

Install kubectl:
#+begin_src shell
  sudo apt update && sudo apt install -y apt-transport-https gnupg2
  curl -s https://packages.cloud.google.com/apt/doc/apt-key.gpg | sudo apt-key add -
  echo "deb https://apt.kubernetes.io/ kubernetes-xenial main" | sudo tee -a /etc/apt/sources.list.d/kubernetes.list
  sudo apt update
  sudo apt install -y kubectl
#+end_src

#+RESULTS:
#+BEGIN_example
Hit:1 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal InRelease
Hit:2 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-updates InRelease
Hit:3 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-backports InRelease
Hit:4 https://download.docker.com/linux/ubuntu focal InRelease
Get:5 http://security.ubuntu.com/ubuntu focal-security InRelease [107 kB]
Fetched 107 kB in 1s (74.0 kB/s)
Reading package lists...
Building dependency tree...
Reading state information...
14 packages can be upgraded. Run 'apt list --upgradable' to see them.
Reading package lists...
Building dependency tree...
Reading state information...
apt-transport-https is already the newest version (2.0.2ubuntu0.1).
The following NEW packages will be installed:
  gnupg2
0 upgraded, 1 newly installed, 0 to remove and 14 not upgraded.
Need to get 5316 B of archives.
After this operation, 51.2 kB of additional disk space will be used.
Get:1 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 gnupg2 all 2.2.19-3ubuntu2 [5316 B]
Fetched 5316 B in 0s (527 kB/s)
Selecting previously unselected package gnupg2.
(Reading database ... (Reading database ... 5%(Reading database ... 10%(Reading database ... 15%(Reading database ... 20%(Reading database ... 25%(Reading database ... 30%(Reading database ... 35%(Reading database ... 40%(Reading database ... 45%(Reading database ... 50%(Reading database ... 55%(Reading database ... 60%(Reading database ... 65%(Reading database ... 70%(Reading database ... 75%(Reading database ... 80%(Reading database ... 85%(Reading database ... 90%(Reading database ... 95%(Reading database ... 100%(Reading database ... 63992 files and directories currently installed.)
Preparing to unpack .../gnupg2_2.2.19-3ubuntu2_all.deb ...
Unpacking gnupg2 (2.2.19-3ubuntu2) ...
Setting up gnupg2 (2.2.19-3ubuntu2) ...
Processing triggers for man-db (2.9.1-1) ...
OK
deb https://apt.kubernetes.io/ kubernetes-xenial main
Hit:1 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal InRelease
Hit:2 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-updates InRelease
Hit:3 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-backports InRelease
Hit:4 https://download.docker.com/linux/ubuntu focal InRelease
Get:6 http://security.ubuntu.com/ubuntu focal-security InRelease [107 kB]
Get:5 https://packages.cloud.google.com/apt kubernetes-xenial InRelease [8993 B]
Get:7 https://packages.cloud.google.com/apt kubernetes-xenial/main amd64 Packages [38.8 kB]
Fetched 155 kB in 1s (110 kB/s)
Reading package lists...
Building dependency tree...
Reading state information...
14 packages can be upgraded. Run 'apt list --upgradable' to see them.
Reading package lists...
Building dependency tree...
Reading state information...
The following NEW packages will be installed:
  kubectl
0 upgraded, 1 newly installed, 0 to remove and 14 not upgraded.
Need to get 8826 kB of archives.
After this operation, 44.0 MB of additional disk space will be used.
Get:1 https://packages.cloud.google.com/apt kubernetes-xenial/main amd64 kubectl amd64 1.18.6-00 [8826 kB]
Fetched 8826 kB in 2s (5503 kB/s)
Selecting previously unselected package kubectl.
(Reading database ... (Reading database ... 5%(Reading database ... 10%(Reading database ... 15%(Reading database ... 20%(Reading database ... 25%(Reading database ... 30%(Reading database ... 35%(Reading database ... 40%(Reading database ... 45%(Reading database ... 50%(Reading database ... 55%(Reading database ... 60%(Reading database ... 65%(Reading database ... 70%(Reading database ... 75%(Reading database ... 80%(Reading database ... 85%(Reading database ... 90%(Reading database ... 95%(Reading database ... 100%(Reading database ... 63998 files and directories currently installed.)
Preparing to unpack .../kubectl_1.18.6-00_amd64.deb ...
Unpacking kubectl (1.18.6-00) ...
Setting up kubectl (1.18.6-00) ...
#+END_example

Install golang:
#+begin_src shell
  export GO_VERSION=1.15rc1
  curl -L https://dl.google.com/go/go${GO_VERSION}.linux-amd64.tar.gz | sudo tar --directory /usr/local --extract --ungzip
  echo 'export PATH=$PATH:/usr/local/go/bin' >> ~/.bashrc
  export PATH=$PATH:/usr/local/go/bin
#+end_src

#+RESULTS:
#+BEGIN_example
#+END_example

Install bazel:
#+begin_src shell
  export BAZEL_VERSION=2.2.0
  sudo curl -L -o /usr/local/bin/bazel https://github.com/bazelbuild/bazel/releases/download/${BAZEL_VERSION}/bazel-${BAZEL_VERSION}-linux-x86_64
  sudo chmod +x /usr/local/bin/bazel && bazel
#+end_src

#+RESULTS:
#+BEGIN_example
                                                           [bazel release 2.2.0]
Usage: bazel <command> <options> ...

Available commands:
  analyze-profile     Analyzes build profile data.
  aquery              Analyzes the given targets and queries the action graph.
  build               Builds the specified targets.
  canonicalize-flags  Canonicalizes a list of bazel options.
  clean               Removes output files and optionally stops the server.
  coverage            Generates code coverage report for specified test targets.
  cquery              Loads, analyzes, and queries the specified targets w/ configurations.
  dump                Dumps the internal state of the bazel server process.
  fetch               Fetches external repositories that are prerequisites to the targets.
  help                Prints help for commands, or the index.
  info                Displays runtime info about the bazel server.
  license             Prints the license of this software.
  mobile-install      Installs targets to mobile devices.
  print_action        Prints the command line args for compiling a file.
  query               Executes a dependency graph query.
  run                 Runs the specified target.
  shutdown            Stops the bazel server.
  sync                Syncs all repositories specified in the workspace file
  test                Builds and runs the specified test targets.
  version             Prints version information for bazel.

Getting more help:
  bazel help <command>
                   Prints help and options for <command>.
  bazel help startup_options
                   Options for the JVM hosting bazel.
  bazel help target-syntax
                   Explains the syntax for specifying targets.
  bazel help info-keys
                   Displays a list of keys used by the info command.
#+END_example

Install aws-cli:
#+begin_src shell
  sudo apt install -y awscli
#+end_src

#+RESULTS:
#+BEGIN_example
Reading package lists...
Building dependency tree...
Reading state information...
The following additional packages will be installed:
  docutils-common fontconfig fontconfig-config fonts-dejavu-core
  fonts-droid-fallback fonts-noto-mono fonts-urw-base35 ghostscript groff
  gsfonts hicolor-icon-theme imagemagick imagemagick-6-common
  imagemagick-6.q16 libavahi-client3 libavahi-common-data libavahi-common3
  libcairo2 libcups2 libdatrie1 libdjvulibre-text libdjvulibre21
  libfftw3-double3 libfontconfig1 libgomp1 libgraphite2-3 libgs9 libgs9-common
  libharfbuzz0b libice6 libidn11 libijs-0.35 libilmbase24 libimagequant0
  libjbig0 libjbig2dec0 libjpeg-turbo8 libjpeg8 liblqr-1-0
  libmagickcore-6.q16-6 libmagickcore-6.q16-6-extra libmagickwand-6.q16-6
  libnetpbm10 libopenexr24 libopenjp2-7 libpango-1.0-0 libpangocairo-1.0-0
  libpangoft2-1.0-0 libpaper-utils libpaper1 libpixman-1-0 libsm6 libthai-data
  libthai0 libtiff5 libwebp6 libwebpdemux2 libwebpmux3 libwmf0.2-7 libxaw7
  libxcb-render0 libxcb-shm0 libxmu6 libxpm4 libxrender1 libxt6 netpbm
  poppler-data psutils python3-botocore python3-dateutil python3-docutils
  python3-jmespath python3-olefile python3-pil python3-pygments python3-roman
  python3-rsa python3-s3transfer sgml-base x11-common xml-core
Suggested packages:
  fonts-noto fonts-freefont-otf | fonts-freefont-ttf fonts-texgyre
  ghostscript-x imagemagick-doc autotrace cups-bsd | lpr | lprng enscript
  ffmpeg gimp gnuplot grads graphviz hp2xx html2ps libwmf-bin mplayer povray
  radiance sane-utils texlive-base-bin transfig ufraw-batch xdg-utils
  cups-common libfftw3-bin libfftw3-dev inkscape libjxr-tools libwmf0.2-7-gtk
  poppler-utils fonts-japanese-mincho | fonts-ipafont-mincho
  fonts-japanese-gothic | fonts-ipafont-gothic fonts-arphic-ukai
  fonts-arphic-uming fonts-nanum docutils-doc fonts-linuxlibertine
  | ttf-linux-libertine texlive-lang-french texlive-latex-base
  texlive-latex-recommended python-pil-doc python3-pil-dbg python-pygments-doc
  ttf-bitstream-vera sgml-base-doc debhelper
The following NEW packages will be installed:
  awscli docutils-common fontconfig fontconfig-config fonts-dejavu-core
  fonts-droid-fallback fonts-noto-mono fonts-urw-base35 ghostscript groff
  gsfonts hicolor-icon-theme imagemagick imagemagick-6-common
  imagemagick-6.q16 libavahi-client3 libavahi-common-data libavahi-common3
  libcairo2 libcups2 libdatrie1 libdjvulibre-text libdjvulibre21
  libfftw3-double3 libfontconfig1 libgomp1 libgraphite2-3 libgs9 libgs9-common
  libharfbuzz0b libice6 libidn11 libijs-0.35 libilmbase24 libimagequant0
  libjbig0 libjbig2dec0 libjpeg-turbo8 libjpeg8 liblqr-1-0
  libmagickcore-6.q16-6 libmagickcore-6.q16-6-extra libmagickwand-6.q16-6
  libnetpbm10 libopenexr24 libopenjp2-7 libpango-1.0-0 libpangocairo-1.0-0
  libpangoft2-1.0-0 libpaper-utils libpaper1 libpixman-1-0 libsm6 libthai-data
  libthai0 libtiff5 libwebp6 libwebpdemux2 libwebpmux3 libwmf0.2-7 libxaw7
  libxcb-render0 libxcb-shm0 libxmu6 libxpm4 libxrender1 libxt6 netpbm
  poppler-data psutils python3-botocore python3-dateutil python3-docutils
  python3-jmespath python3-olefile python3-pil python3-pygments python3-roman
  python3-rsa python3-s3transfer sgml-base x11-common xml-core
0 upgraded, 83 newly installed, 0 to remove and 14 not upgraded.
Need to get 36.2 MB of archives.
After this operation, 170 MB of additional disk space will be used.
Get:1 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 fonts-droid-fallback all 1:6.0.1r16-1.1 [1805 kB]
Get:2 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libgomp1 amd64 10-20200411-0ubuntu1 [101 kB]
Get:3 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libfftw3-double3 amd64 3.3.8-2ubuntu1 [728 kB]
Get:4 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 fonts-dejavu-core all 2.37-1 [1041 kB]
Get:5 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 fontconfig-config all 2.13.1-2ubuntu3 [28.8 kB]
Get:6 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libfontconfig1 amd64 2.13.1-2ubuntu3 [114 kB]
Get:7 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libjbig0 amd64 2.1-3.1build1 [26.7 kB]
Get:8 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-updates/main amd64 libjpeg-turbo8 amd64 2.0.3-0ubuntu1.20.04.1 [117 kB]
Get:9 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libjpeg8 amd64 8c-2ubuntu8 [2194 B]
Get:10 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 liblqr-1-0 amd64 0.4.2-2.1 [27.7 kB]
Get:11 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libwebp6 amd64 0.6.1-2 [185 kB]
Get:12 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libtiff5 amd64 4.1.0+git191117-2build1 [161 kB]
Get:13 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libwebpmux3 amd64 0.6.1-2 [19.6 kB]
Get:14 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 imagemagick-6-common all 8:6.9.10.23+dfsg-2.1ubuntu11 [60.8 kB]
Get:15 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 libmagickcore-6.q16-6 amd64 8:6.9.10.23+dfsg-2.1ubuntu11 [1645 kB]
Get:16 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 libmagickwand-6.q16-6 amd64 8:6.9.10.23+dfsg-2.1ubuntu11 [305 kB]
Get:17 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 poppler-data all 0.4.9-2 [1475 kB]
Get:18 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 sgml-base all 1.29.1 [12.4 kB]
Get:19 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 x11-common all 1:7.7+19ubuntu14 [22.3 kB]
Get:20 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libice6 amd64 2:1.0.10-0ubuntu1 [41.0 kB]
Get:21 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libsm6 amd64 2:1.2.3-1 [16.1 kB]
Get:22 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libxt6 amd64 1:1.1.5-1 [160 kB]
Get:23 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libxmu6 amd64 2:1.1.3-0ubuntu1 [45.8 kB]
Get:24 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libxpm4 amd64 1:3.5.12-1 [34.0 kB]
Get:25 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libxaw7 amd64 2:1.0.13-1 [173 kB]
Get:26 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 groff amd64 1.22.4-4build1 [3951 kB]
Get:27 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 python3-dateutil all 2.7.3-3ubuntu1 [63.3 kB]
Get:28 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 xml-core all 0.18+nmu1 [21.6 kB]
Get:29 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 docutils-common all 0.16+dfsg-2 [116 kB]
Get:30 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 python3-roman all 2.0.0-3build1 [8728 B]
Get:31 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 python3-docutils all 0.16+dfsg-2 [368 kB]
Get:32 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 python3-jmespath all 0.9.4-2 [21.3 kB]
Get:33 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-updates/universe amd64 python3-botocore all 1.16.19+repack-1ubuntu0.20.04.1 [3255 kB]
Get:34 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 python3-rsa all 4.0-3 [24.7 kB]
Get:35 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 python3-s3transfer all 0.3.3-1 [46.6 kB]
Get:36 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-updates/universe amd64 awscli all 1.18.69-1ubuntu0.20.04.1 [967 kB]
Get:37 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 fontconfig amd64 2.13.1-2ubuntu3 [171 kB]
Get:38 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 fonts-noto-mono all 20200323-1 [80.8 kB]
Get:39 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 fonts-urw-base35 all 20170801.1-3 [6333 kB]
Get:40 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-updates/main amd64 libgs9-common all 9.50~dfsg-5ubuntu4.1 [681 kB]
Get:41 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libavahi-common-data amd64 0.7-4ubuntu7 [21.4 kB]
Get:42 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libavahi-common3 amd64 0.7-4ubuntu7 [21.7 kB]
Get:43 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libavahi-client3 amd64 0.7-4ubuntu7 [25.5 kB]
Get:44 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-updates/main amd64 libcups2 amd64 2.3.1-9ubuntu1.1 [233 kB]
Get:45 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libidn11 amd64 1.33-2.2ubuntu2 [46.2 kB]
Get:46 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libijs-0.35 amd64 0.35-15 [15.7 kB]
Get:47 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libjbig2dec0 amd64 0.18-1ubuntu1 [60.0 kB]
Get:48 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libopenjp2-7 amd64 2.3.1-1ubuntu4 [141 kB]
Get:49 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libpaper1 amd64 1.1.28 [13.0 kB]
Get:50 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-updates/main amd64 libgs9 amd64 9.50~dfsg-5ubuntu4.1 [2171 kB]
Get:51 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-updates/main amd64 ghostscript amd64 9.50~dfsg-5ubuntu4.1 [51.5 kB]
Get:52 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 gsfonts all 1:8.11+urwcyr1.0.7~pre44-4.4 [3120 kB]
Get:53 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 hicolor-icon-theme all 0.17-2 [9976 B]
Get:54 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 imagemagick-6.q16 amd64 8:6.9.10.23+dfsg-2.1ubuntu11 [427 kB]
Get:55 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 imagemagick amd64 8:6.9.10.23+dfsg-2.1ubuntu11 [14.4 kB]
Get:56 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libpixman-1-0 amd64 0.38.4-0ubuntu1 [227 kB]
Get:57 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libxcb-render0 amd64 1.14-2 [14.8 kB]
Get:58 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libxcb-shm0 amd64 1.14-2 [5584 B]
Get:59 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libxrender1 amd64 1:0.9.10-1 [18.7 kB]
Get:60 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libcairo2 amd64 1.16.0-4ubuntu1 [583 kB]
Get:61 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libdatrie1 amd64 0.2.12-3 [18.7 kB]
Get:62 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libdjvulibre-text all 3.5.27.1-14build1 [48.9 kB]
Get:63 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libdjvulibre21 amd64 3.5.27.1-14build1 [577 kB]
Get:64 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libgraphite2-3 amd64 1.3.13-11build1 [73.5 kB]
Get:65 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libharfbuzz0b amd64 2.6.4-1ubuntu4 [391 kB]
Get:66 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 libilmbase24 amd64 2.3.0-6build1 [75.1 kB]
Get:67 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libimagequant0 amd64 2.12.2-1.1 [31.4 kB]
Get:68 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-updates/universe amd64 libopenexr24 amd64 2.3.0-6ubuntu0.2 [584 kB]
Get:69 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libthai-data all 0.1.28-3 [134 kB]
Get:70 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libthai0 amd64 0.1.28-3 [18.1 kB]
Get:71 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libpango-1.0-0 amd64 1.44.7-2ubuntu4 [162 kB]
Get:72 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libpangoft2-1.0-0 amd64 1.44.7-2ubuntu4 [34.9 kB]
Get:73 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libpangocairo-1.0-0 amd64 1.44.7-2ubuntu4 [24.8 kB]
Get:74 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libwmf0.2-7 amd64 0.2.8.4-17ubuntu1 [149 kB]
Get:75 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 libmagickcore-6.q16-6-extra amd64 8:6.9.10.23+dfsg-2.1ubuntu11 [64.6 kB]
Get:76 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 libnetpbm10 amd64 2:10.0-15.3build1 [58.0 kB]
Get:77 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libpaper-utils amd64 1.1.28 [8400 B]
Get:78 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 libwebpdemux2 amd64 0.6.1-2 [9472 B]
Get:79 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 netpbm amd64 2:10.0-15.3build1 [1017 kB]
Get:80 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/universe amd64 psutils amd64 1.17.dfsg-4 [56.2 kB]
Get:81 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 python3-olefile all 0.46-2 [33.7 kB]
Get:82 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal-updates/main amd64 python3-pil amd64 7.0.0-4ubuntu0.1 [362 kB]
Get:83 http://ap-southeast-2.ec2.archive.ubuntu.com/ubuntu focal/main amd64 python3-pygments all 2.3.1+dfsg-1ubuntu2 [579 kB]
Fetched 36.2 MB in 12s (2997 kB/s)
Selecting previously unselected package fonts-droid-fallback.
(Reading database ... (Reading database ... 5%(Reading database ... 10%(Reading database ... 15%(Reading database ... 20%(Reading database ... 25%(Reading database ... 30%(Reading database ... 35%(Reading database ... 40%(Reading database ... 45%(Reading database ... 50%(Reading database ... 55%(Reading database ... 60%(Reading database ... 65%(Reading database ... 70%(Reading database ... 75%(Reading database ... 80%(Reading database ... 85%(Reading database ... 90%(Reading database ... 95%(Reading database ... 100%(Reading database ... 63999 files and directories currently installed.)
Preparing to unpack .../00-fonts-droid-fallback_1%3a6.0.1r16-1.1_all.deb ...
Unpacking fonts-droid-fallback (1:6.0.1r16-1.1) ...
Selecting previously unselected package libgomp1:amd64.
Preparing to unpack .../01-libgomp1_10-20200411-0ubuntu1_amd64.deb ...
Unpacking libgomp1:amd64 (10-20200411-0ubuntu1) ...
Selecting previously unselected package libfftw3-double3:amd64.
Preparing to unpack .../02-libfftw3-double3_3.3.8-2ubuntu1_amd64.deb ...
Unpacking libfftw3-double3:amd64 (3.3.8-2ubuntu1) ...
Selecting previously unselected package fonts-dejavu-core.
Preparing to unpack .../03-fonts-dejavu-core_2.37-1_all.deb ...
Unpacking fonts-dejavu-core (2.37-1) ...
Selecting previously unselected package fontconfig-config.
Preparing to unpack .../04-fontconfig-config_2.13.1-2ubuntu3_all.deb ...
Unpacking fontconfig-config (2.13.1-2ubuntu3) ...
Selecting previously unselected package libfontconfig1:amd64.
Preparing to unpack .../05-libfontconfig1_2.13.1-2ubuntu3_amd64.deb ...
Unpacking libfontconfig1:amd64 (2.13.1-2ubuntu3) ...
Selecting previously unselected package libjbig0:amd64.
Preparing to unpack .../06-libjbig0_2.1-3.1build1_amd64.deb ...
Unpacking libjbig0:amd64 (2.1-3.1build1) ...
Selecting previously unselected package libjpeg-turbo8:amd64.
Preparing to unpack .../07-libjpeg-turbo8_2.0.3-0ubuntu1.20.04.1_amd64.deb ...
Unpacking libjpeg-turbo8:amd64 (2.0.3-0ubuntu1.20.04.1) ...
Selecting previously unselected package libjpeg8:amd64.
Preparing to unpack .../08-libjpeg8_8c-2ubuntu8_amd64.deb ...
Unpacking libjpeg8:amd64 (8c-2ubuntu8) ...
Selecting previously unselected package liblqr-1-0:amd64.
Preparing to unpack .../09-liblqr-1-0_0.4.2-2.1_amd64.deb ...
Unpacking liblqr-1-0:amd64 (0.4.2-2.1) ...
Selecting previously unselected package libwebp6:amd64.
Preparing to unpack .../10-libwebp6_0.6.1-2_amd64.deb ...
Unpacking libwebp6:amd64 (0.6.1-2) ...
Selecting previously unselected package libtiff5:amd64.
Preparing to unpack .../11-libtiff5_4.1.0+git191117-2build1_amd64.deb ...
Unpacking libtiff5:amd64 (4.1.0+git191117-2build1) ...
Selecting previously unselected package libwebpmux3:amd64.
Preparing to unpack .../12-libwebpmux3_0.6.1-2_amd64.deb ...
Unpacking libwebpmux3:amd64 (0.6.1-2) ...
Selecting previously unselected package imagemagick-6-common.
Preparing to unpack .../13-imagemagick-6-common_8%3a6.9.10.23+dfsg-2.1ubuntu11_all.deb ...
Unpacking imagemagick-6-common (8:6.9.10.23+dfsg-2.1ubuntu11) ...
Selecting previously unselected package libmagickcore-6.q16-6:amd64.
Preparing to unpack .../14-libmagickcore-6.q16-6_8%3a6.9.10.23+dfsg-2.1ubuntu11_amd64.deb ...
Unpacking libmagickcore-6.q16-6:amd64 (8:6.9.10.23+dfsg-2.1ubuntu11) ...
Selecting previously unselected package libmagickwand-6.q16-6:amd64.
Preparing to unpack .../15-libmagickwand-6.q16-6_8%3a6.9.10.23+dfsg-2.1ubuntu11_amd64.deb ...
Unpacking libmagickwand-6.q16-6:amd64 (8:6.9.10.23+dfsg-2.1ubuntu11) ...
Selecting previously unselected package poppler-data.
Preparing to unpack .../16-poppler-data_0.4.9-2_all.deb ...
Unpacking poppler-data (0.4.9-2) ...
Selecting previously unselected package sgml-base.
Preparing to unpack .../17-sgml-base_1.29.1_all.deb ...
Unpacking sgml-base (1.29.1) ...
Selecting previously unselected package x11-common.
Preparing to unpack .../18-x11-common_1%3a7.7+19ubuntu14_all.deb ...
dpkg-query: no packages found matching nux-tools
Unpacking x11-common (1:7.7+19ubuntu14) ...
Selecting previously unselected package libice6:amd64.
Preparing to unpack .../19-libice6_2%3a1.0.10-0ubuntu1_amd64.deb ...
Unpacking libice6:amd64 (2:1.0.10-0ubuntu1) ...
Selecting previously unselected package libsm6:amd64.
Preparing to unpack .../20-libsm6_2%3a1.2.3-1_amd64.deb ...
Unpacking libsm6:amd64 (2:1.2.3-1) ...
Selecting previously unselected package libxt6:amd64.
Preparing to unpack .../21-libxt6_1%3a1.1.5-1_amd64.deb ...
Unpacking libxt6:amd64 (1:1.1.5-1) ...
Selecting previously unselected package libxmu6:amd64.
Preparing to unpack .../22-libxmu6_2%3a1.1.3-0ubuntu1_amd64.deb ...
Unpacking libxmu6:amd64 (2:1.1.3-0ubuntu1) ...
Selecting previously unselected package libxpm4:amd64.
Preparing to unpack .../23-libxpm4_1%3a3.5.12-1_amd64.deb ...
Unpacking libxpm4:amd64 (1:3.5.12-1) ...
Selecting previously unselected package libxaw7:amd64.
Preparing to unpack .../24-libxaw7_2%3a1.0.13-1_amd64.deb ...
Unpacking libxaw7:amd64 (2:1.0.13-1) ...
Selecting previously unselected package groff.
Preparing to unpack .../25-groff_1.22.4-4build1_amd64.deb ...
Unpacking groff (1.22.4-4build1) ...
Selecting previously unselected package python3-dateutil.
Preparing to unpack .../26-python3-dateutil_2.7.3-3ubuntu1_all.deb ...
Unpacking python3-dateutil (2.7.3-3ubuntu1) ...
Selecting previously unselected package xml-core.
Preparing to unpack .../27-xml-core_0.18+nmu1_all.deb ...
Unpacking xml-core (0.18+nmu1) ...
Selecting previously unselected package docutils-common.
Preparing to unpack .../28-docutils-common_0.16+dfsg-2_all.deb ...
Unpacking docutils-common (0.16+dfsg-2) ...
Selecting previously unselected package python3-roman.
Preparing to unpack .../29-python3-roman_2.0.0-3build1_all.deb ...
Unpacking python3-roman (2.0.0-3build1) ...
Selecting previously unselected package python3-docutils.
Preparing to unpack .../30-python3-docutils_0.16+dfsg-2_all.deb ...
Unpacking python3-docutils (0.16+dfsg-2) ...
Selecting previously unselected package python3-jmespath.
Preparing to unpack .../31-python3-jmespath_0.9.4-2_all.deb ...
Unpacking python3-jmespath (0.9.4-2) ...
Selecting previously unselected package python3-botocore.
Preparing to unpack .../32-python3-botocore_1.16.19+repack-1ubuntu0.20.04.1_all.deb ...
Unpacking python3-botocore (1.16.19+repack-1ubuntu0.20.04.1) ...
Selecting previously unselected package python3-rsa.
Preparing to unpack .../33-python3-rsa_4.0-3_all.deb ...
Unpacking python3-rsa (4.0-3) ...
Selecting previously unselected package python3-s3transfer.
Preparing to unpack .../34-python3-s3transfer_0.3.3-1_all.deb ...
Unpacking python3-s3transfer (0.3.3-1) ...
Selecting previously unselected package awscli.
Preparing to unpack .../35-awscli_1.18.69-1ubuntu0.20.04.1_all.deb ...
Unpacking awscli (1.18.69-1ubuntu0.20.04.1) ...
Selecting previously unselected package fontconfig.
Preparing to unpack .../36-fontconfig_2.13.1-2ubuntu3_amd64.deb ...
Unpacking fontconfig (2.13.1-2ubuntu3) ...
Selecting previously unselected package fonts-noto-mono.
Preparing to unpack .../37-fonts-noto-mono_20200323-1_all.deb ...
Unpacking fonts-noto-mono (20200323-1) ...
Selecting previously unselected package fonts-urw-base35.
Preparing to unpack .../38-fonts-urw-base35_20170801.1-3_all.deb ...
Unpacking fonts-urw-base35 (20170801.1-3) ...
Selecting previously unselected package libgs9-common.
Preparing to unpack .../39-libgs9-common_9.50~dfsg-5ubuntu4.1_all.deb ...
Unpacking libgs9-common (9.50~dfsg-5ubuntu4.1) ...
Selecting previously unselected package libavahi-common-data:amd64.
Preparing to unpack .../40-libavahi-common-data_0.7-4ubuntu7_amd64.deb ...
Unpacking libavahi-common-data:amd64 (0.7-4ubuntu7) ...
Selecting previously unselected package libavahi-common3:amd64.
Preparing to unpack .../41-libavahi-common3_0.7-4ubuntu7_amd64.deb ...
Unpacking libavahi-common3:amd64 (0.7-4ubuntu7) ...
Selecting previously unselected package libavahi-client3:amd64.
Preparing to unpack .../42-libavahi-client3_0.7-4ubuntu7_amd64.deb ...
Unpacking libavahi-client3:amd64 (0.7-4ubuntu7) ...
Selecting previously unselected package libcups2:amd64.
Preparing to unpack .../43-libcups2_2.3.1-9ubuntu1.1_amd64.deb ...
Unpacking libcups2:amd64 (2.3.1-9ubuntu1.1) ...
Selecting previously unselected package libidn11:amd64.
Preparing to unpack .../44-libidn11_1.33-2.2ubuntu2_amd64.deb ...
Unpacking libidn11:amd64 (1.33-2.2ubuntu2) ...
Selecting previously unselected package libijs-0.35:amd64.
Preparing to unpack .../45-libijs-0.35_0.35-15_amd64.deb ...
Unpacking libijs-0.35:amd64 (0.35-15) ...
Selecting previously unselected package libjbig2dec0:amd64.
Preparing to unpack .../46-libjbig2dec0_0.18-1ubuntu1_amd64.deb ...
Unpacking libjbig2dec0:amd64 (0.18-1ubuntu1) ...
Selecting previously unselected package libopenjp2-7:amd64.
Preparing to unpack .../47-libopenjp2-7_2.3.1-1ubuntu4_amd64.deb ...
Unpacking libopenjp2-7:amd64 (2.3.1-1ubuntu4) ...
Selecting previously unselected package libpaper1:amd64.
Preparing to unpack .../48-libpaper1_1.1.28_amd64.deb ...
Unpacking libpaper1:amd64 (1.1.28) ...
Selecting previously unselected package libgs9:amd64.
Preparing to unpack .../49-libgs9_9.50~dfsg-5ubuntu4.1_amd64.deb ...
Unpacking libgs9:amd64 (9.50~dfsg-5ubuntu4.1) ...
Selecting previously unselected package ghostscript.
Preparing to unpack .../50-ghostscript_9.50~dfsg-5ubuntu4.1_amd64.deb ...
Unpacking ghostscript (9.50~dfsg-5ubuntu4.1) ...
Selecting previously unselected package gsfonts.
Preparing to unpack .../51-gsfonts_1%3a8.11+urwcyr1.0.7~pre44-4.4_all.deb ...
Unpacking gsfonts (1:8.11+urwcyr1.0.7~pre44-4.4) ...
Selecting previously unselected package hicolor-icon-theme.
Preparing to unpack .../52-hicolor-icon-theme_0.17-2_all.deb ...
Unpacking hicolor-icon-theme (0.17-2) ...
Selecting previously unselected package imagemagick-6.q16.
Preparing to unpack .../53-imagemagick-6.q16_8%3a6.9.10.23+dfsg-2.1ubuntu11_amd64.deb ...
Unpacking imagemagick-6.q16 (8:6.9.10.23+dfsg-2.1ubuntu11) ...
Selecting previously unselected package imagemagick.
Preparing to unpack .../54-imagemagick_8%3a6.9.10.23+dfsg-2.1ubuntu11_amd64.deb ...
Unpacking imagemagick (8:6.9.10.23+dfsg-2.1ubuntu11) ...
Selecting previously unselected package libpixman-1-0:amd64.
Preparing to unpack .../55-libpixman-1-0_0.38.4-0ubuntu1_amd64.deb ...
Unpacking libpixman-1-0:amd64 (0.38.4-0ubuntu1) ...
Selecting previously unselected package libxcb-render0:amd64.
Preparing to unpack .../56-libxcb-render0_1.14-2_amd64.deb ...
Unpacking libxcb-render0:amd64 (1.14-2) ...
Selecting previously unselected package libxcb-shm0:amd64.
Preparing to unpack .../57-libxcb-shm0_1.14-2_amd64.deb ...
Unpacking libxcb-shm0:amd64 (1.14-2) ...
Selecting previously unselected package libxrender1:amd64.
Preparing to unpack .../58-libxrender1_1%3a0.9.10-1_amd64.deb ...
Unpacking libxrender1:amd64 (1:0.9.10-1) ...
Selecting previously unselected package libcairo2:amd64.
Preparing to unpack .../59-libcairo2_1.16.0-4ubuntu1_amd64.deb ...
Unpacking libcairo2:amd64 (1.16.0-4ubuntu1) ...
Selecting previously unselected package libdatrie1:amd64.
Preparing to unpack .../60-libdatrie1_0.2.12-3_amd64.deb ...
Unpacking libdatrie1:amd64 (0.2.12-3) ...
Selecting previously unselected package libdjvulibre-text.
Preparing to unpack .../61-libdjvulibre-text_3.5.27.1-14build1_all.deb ...
Unpacking libdjvulibre-text (3.5.27.1-14build1) ...
Selecting previously unselected package libdjvulibre21:amd64.
Preparing to unpack .../62-libdjvulibre21_3.5.27.1-14build1_amd64.deb ...
Unpacking libdjvulibre21:amd64 (3.5.27.1-14build1) ...
Selecting previously unselected package libgraphite2-3:amd64.
Preparing to unpack .../63-libgraphite2-3_1.3.13-11build1_amd64.deb ...
Unpacking libgraphite2-3:amd64 (1.3.13-11build1) ...
Selecting previously unselected package libharfbuzz0b:amd64.
Preparing to unpack .../64-libharfbuzz0b_2.6.4-1ubuntu4_amd64.deb ...
Unpacking libharfbuzz0b:amd64 (2.6.4-1ubuntu4) ...
Selecting previously unselected package libilmbase24:amd64.
Preparing to unpack .../65-libilmbase24_2.3.0-6build1_amd64.deb ...
Unpacking libilmbase24:amd64 (2.3.0-6build1) ...
Selecting previously unselected package libimagequant0:amd64.
Preparing to unpack .../66-libimagequant0_2.12.2-1.1_amd64.deb ...
Unpacking libimagequant0:amd64 (2.12.2-1.1) ...
Selecting previously unselected package libopenexr24:amd64.
Preparing to unpack .../67-libopenexr24_2.3.0-6ubuntu0.2_amd64.deb ...
Unpacking libopenexr24:amd64 (2.3.0-6ubuntu0.2) ...
Selecting previously unselected package libthai-data.
Preparing to unpack .../68-libthai-data_0.1.28-3_all.deb ...
Unpacking libthai-data (0.1.28-3) ...
Selecting previously unselected package libthai0:amd64.
Preparing to unpack .../69-libthai0_0.1.28-3_amd64.deb ...
Unpacking libthai0:amd64 (0.1.28-3) ...
Selecting previously unselected package libpango-1.0-0:amd64.
Preparing to unpack .../70-libpango-1.0-0_1.44.7-2ubuntu4_amd64.deb ...
Unpacking libpango-1.0-0:amd64 (1.44.7-2ubuntu4) ...
Selecting previously unselected package libpangoft2-1.0-0:amd64.
Preparing to unpack .../71-libpangoft2-1.0-0_1.44.7-2ubuntu4_amd64.deb ...
Unpacking libpangoft2-1.0-0:amd64 (1.44.7-2ubuntu4) ...
Selecting previously unselected package libpangocairo-1.0-0:amd64.
Preparing to unpack .../72-libpangocairo-1.0-0_1.44.7-2ubuntu4_amd64.deb ...
Unpacking libpangocairo-1.0-0:amd64 (1.44.7-2ubuntu4) ...
Selecting previously unselected package libwmf0.2-7:amd64.
Preparing to unpack .../73-libwmf0.2-7_0.2.8.4-17ubuntu1_amd64.deb ...
Unpacking libwmf0.2-7:amd64 (0.2.8.4-17ubuntu1) ...
Selecting previously unselected package libmagickcore-6.q16-6-extra:amd64.
Preparing to unpack .../74-libmagickcore-6.q16-6-extra_8%3a6.9.10.23+dfsg-2.1ubuntu11_amd64.deb ...
Unpacking libmagickcore-6.q16-6-extra:amd64 (8:6.9.10.23+dfsg-2.1ubuntu11) ...
Selecting previously unselected package libnetpbm10.
Preparing to unpack .../75-libnetpbm10_2%3a10.0-15.3build1_amd64.deb ...
Unpacking libnetpbm10 (2:10.0-15.3build1) ...
Selecting previously unselected package libpaper-utils.
Preparing to unpack .../76-libpaper-utils_1.1.28_amd64.deb ...
Unpacking libpaper-utils (1.1.28) ...
Selecting previously unselected package libwebpdemux2:amd64.
Preparing to unpack .../77-libwebpdemux2_0.6.1-2_amd64.deb ...
Unpacking libwebpdemux2:amd64 (0.6.1-2) ...
Selecting previously unselected package netpbm.
Preparing to unpack .../78-netpbm_2%3a10.0-15.3build1_amd64.deb ...
Unpacking netpbm (2:10.0-15.3build1) ...
Selecting previously unselected package psutils.
Preparing to unpack .../79-psutils_1.17.dfsg-4_amd64.deb ...
Unpacking psutils (1.17.dfsg-4) ...
Selecting previously unselected package python3-olefile.
Preparing to unpack .../80-python3-olefile_0.46-2_all.deb ...
Unpacking python3-olefile (0.46-2) ...
Selecting previously unselected package python3-pil:amd64.
Preparing to unpack .../81-python3-pil_7.0.0-4ubuntu0.1_amd64.deb ...
Unpacking python3-pil:amd64 (7.0.0-4ubuntu0.1) ...
Selecting previously unselected package python3-pygments.
Preparing to unpack .../82-python3-pygments_2.3.1+dfsg-1ubuntu2_all.deb ...
Unpacking python3-pygments (2.3.1+dfsg-1ubuntu2) ...
Setting up libgraphite2-3:amd64 (1.3.13-11build1) ...
Setting up libpixman-1-0:amd64 (0.38.4-0ubuntu1) ...
Setting up libpaper1:amd64 (1.1.28) ...
debconf: unable to initialize frontend: Dialog
debconf: (Dialog frontend will not work on a dumb terminal, an emacs shell buffer, or without a controlling terminal.)
debconf: falling back to frontend: Readline

Creating config file /etc/papersize with new version
Setting up imagemagick-6-common (8:6.9.10.23+dfsg-2.1ubuntu11) ...
Setting up fonts-noto-mono (20200323-1) ...
Setting up libxpm4:amd64 (1:3.5.12-1) ...
Setting up hicolor-icon-theme (0.17-2) ...
Setting up libxrender1:amd64 (1:0.9.10-1) ...
Setting up libdatrie1:amd64 (0.2.12-3) ...
Setting up libxcb-render0:amd64 (1.14-2) ...
Setting up libijs-0.35:amd64 (0.35-15) ...
Setting up python3-olefile (0.46-2) ...
Setting up x11-common (1:7.7+19ubuntu14) ...
debconf: unable to initialize frontend: Dialog
debconf: (Dialog frontend will not work on a dumb terminal, an emacs shell buffer, or without a controlling terminal.)
debconf: falling back to frontend: Readline
update-rc.d: warning: start and stop actions are no longer supported; falling back to defaults
Setting up libxcb-shm0:amd64 (1.14-2) ...
Setting up libpaper-utils (1.1.28) ...
Setting up libnetpbm10 (2:10.0-15.3build1) ...
Setting up fonts-urw-base35 (20170801.1-3) ...
Setting up libgomp1:amd64 (10-20200411-0ubuntu1) ...
Setting up libilmbase24:amd64 (2.3.0-6build1) ...
Setting up libjbig0:amd64 (2.1-3.1build1) ...
Setting up poppler-data (0.4.9-2) ...
Setting up python3-roman (2.0.0-3build1) ...
Setting up python3-pygments (2.3.1+dfsg-1ubuntu2) ...
Setting up libopenexr24:amd64 (2.3.0-6ubuntu0.2) ...
Setting up libjbig2dec0:amd64 (0.18-1ubuntu1) ...
Setting up libidn11:amd64 (1.33-2.2ubuntu2) ...
Setting up python3-jmespath (0.9.4-2) ...
/usr/lib/python3/dist-packages/jmespath/visitor.py:32: SyntaxWarning: "is" with a literal. Did you mean "=="?
  if x is 0 or x is 1:
/usr/lib/python3/dist-packages/jmespath/visitor.py:32: SyntaxWarning: "is" with a literal. Did you mean "=="?
  if x is 0 or x is 1:
/usr/lib/python3/dist-packages/jmespath/visitor.py:34: SyntaxWarning: "is" with a literal. Did you mean "=="?
  elif y is 0 or y is 1:
/usr/lib/python3/dist-packages/jmespath/visitor.py:34: SyntaxWarning: "is" with a literal. Did you mean "=="?
  elif y is 0 or y is 1:
/usr/lib/python3/dist-packages/jmespath/visitor.py:260: SyntaxWarning: "is" with a literal. Did you mean "=="?
  if original_result is 0:
Setting up gsfonts (1:8.11+urwcyr1.0.7~pre44-4.4) ...
Setting up libavahi-common-data:amd64 (0.7-4ubuntu7) ...
Setting up libimagequant0:amd64 (2.12.2-1.1) ...
Setting up libwebp6:amd64 (0.6.1-2) ...
Setting up fonts-dejavu-core (2.37-1) ...
Setting up libjpeg-turbo8:amd64 (2.0.3-0ubuntu1.20.04.1) ...
Setting up libfftw3-double3:amd64 (3.3.8-2ubuntu1) ...
Setting up liblqr-1-0:amd64 (0.4.2-2.1) ...
Setting up python3-rsa (4.0-3) ...
Setting up libopenjp2-7:amd64 (2.3.1-1ubuntu4) ...
Setting up libharfbuzz0b:amd64 (2.6.4-1ubuntu4) ...
Setting up libthai-data (0.1.28-3) ...
Setting up python3-dateutil (2.7.3-3ubuntu1) ...
Setting up sgml-base (1.29.1) ...
Setting up fonts-droid-fallback (1:6.0.1r16-1.1) ...
Setting up libdjvulibre-text (3.5.27.1-14build1) ...
Setting up libwebpmux3:amd64 (0.6.1-2) ...
Setting up psutils (1.17.dfsg-4) ...
Setting up libjpeg8:amd64 (8c-2ubuntu8) ...
Setting up libgs9-common (9.50~dfsg-5ubuntu4.1) ...
Setting up libice6:amd64 (2:1.0.10-0ubuntu1) ...
Setting up libwmf0.2-7:amd64 (0.2.8.4-17ubuntu1) ...
Setting up fontconfig-config (2.13.1-2ubuntu3) ...
Setting up libwebpdemux2:amd64 (0.6.1-2) ...
Setting up libdjvulibre21:amd64 (3.5.27.1-14build1) ...
Setting up libavahi-common3:amd64 (0.7-4ubuntu7) ...
Setting up libthai0:amd64 (0.1.28-3) ...
Setting up xml-core (0.18+nmu1) ...
Setting up libtiff5:amd64 (4.1.0+git191117-2build1) ...
Setting up libfontconfig1:amd64 (2.13.1-2ubuntu3) ...
Setting up libsm6:amd64 (2:1.2.3-1) ...
Setting up libavahi-client3:amd64 (0.7-4ubuntu7) ...
Setting up fontconfig (2.13.1-2ubuntu3) ...
Regenerating fonts cache... done.
Setting up libpango-1.0-0:amd64 (1.44.7-2ubuntu4) ...
Setting up libcairo2:amd64 (1.16.0-4ubuntu1) ...
Setting up python3-pil:amd64 (7.0.0-4ubuntu0.1) ...
Setting up libmagickcore-6.q16-6:amd64 (8:6.9.10.23+dfsg-2.1ubuntu11) ...
Setting up netpbm (2:10.0-15.3build1) ...
Setting up libxt6:amd64 (1:1.1.5-1) ...
Setting up libcups2:amd64 (2.3.1-9ubuntu1.1) ...
Setting up libmagickwand-6.q16-6:amd64 (8:6.9.10.23+dfsg-2.1ubuntu11) ...
Setting up libpangoft2-1.0-0:amd64 (1.44.7-2ubuntu4) ...
Setting up libpangocairo-1.0-0:amd64 (1.44.7-2ubuntu4) ...
Setting up libxmu6:amd64 (2:1.1.3-0ubuntu1) ...
Setting up libgs9:amd64 (9.50~dfsg-5ubuntu4.1) ...
Setting up libmagickcore-6.q16-6-extra:amd64 (8:6.9.10.23+dfsg-2.1ubuntu11) ...
Setting up libxaw7:amd64 (2:1.0.13-1) ...
Setting up ghostscript (9.50~dfsg-5ubuntu4.1) ...
Setting up groff (1.22.4-4build1) ...
Setting up imagemagick-6.q16 (8:6.9.10.23+dfsg-2.1ubuntu11) ...
update-alternatives: using /usr/bin/compare-im6.q16 to provide /usr/bin/compare (compare) in auto mode
update-alternatives: using /usr/bin/compare-im6.q16 to provide /usr/bin/compare-im6 (compare-im6) in auto mode
update-alternatives: using /usr/bin/animate-im6.q16 to provide /usr/bin/animate (animate) in auto mode
update-alternatives: using /usr/bin/animate-im6.q16 to provide /usr/bin/animate-im6 (animate-im6) in auto mode
update-alternatives: using /usr/bin/convert-im6.q16 to provide /usr/bin/convert (convert) in auto mode
update-alternatives: using /usr/bin/convert-im6.q16 to provide /usr/bin/convert-im6 (convert-im6) in auto mode
update-alternatives: using /usr/bin/composite-im6.q16 to provide /usr/bin/composite (composite) in auto mode
update-alternatives: using /usr/bin/composite-im6.q16 to provide /usr/bin/composite-im6 (composite-im6) in auto mode
update-alternatives: using /usr/bin/conjure-im6.q16 to provide /usr/bin/conjure (conjure) in auto mode
update-alternatives: using /usr/bin/conjure-im6.q16 to provide /usr/bin/conjure-im6 (conjure-im6) in auto mode
update-alternatives: using /usr/bin/import-im6.q16 to provide /usr/bin/import (import) in auto mode
update-alternatives: using /usr/bin/import-im6.q16 to provide /usr/bin/import-im6 (import-im6) in auto mode
update-alternatives: using /usr/bin/identify-im6.q16 to provide /usr/bin/identify (identify) in auto mode
update-alternatives: using /usr/bin/identify-im6.q16 to provide /usr/bin/identify-im6 (identify-im6) in auto mode
update-alternatives: using /usr/bin/stream-im6.q16 to provide /usr/bin/stream (stream) in auto mode
update-alternatives: using /usr/bin/stream-im6.q16 to provide /usr/bin/stream-im6 (stream-im6) in auto mode
update-alternatives: using /usr/bin/display-im6.q16 to provide /usr/bin/display (display) in auto mode
update-alternatives: using /usr/bin/display-im6.q16 to provide /usr/bin/display-im6 (display-im6) in auto mode
update-alternatives: using /usr/bin/montage-im6.q16 to provide /usr/bin/montage (montage) in auto mode
update-alternatives: using /usr/bin/montage-im6.q16 to provide /usr/bin/montage-im6 (montage-im6) in auto mode
update-alternatives: using /usr/bin/mogrify-im6.q16 to provide /usr/bin/mogrify (mogrify) in auto mode
update-alternatives: using /usr/bin/mogrify-im6.q16 to provide /usr/bin/mogrify-im6 (mogrify-im6) in auto mode
Setting up imagemagick (8:6.9.10.23+dfsg-2.1ubuntu11) ...
Processing triggers for install-info (6.7.0.dfsg.2-5) ...
Processing triggers for mime-support (3.64ubuntu1) ...
Processing triggers for libc-bin (2.31-0ubuntu9) ...
Processing triggers for systemd (245.4-4ubuntu3.2) ...
Processing triggers for man-db (2.9.1-1) ...
Processing triggers for shared-mime-info (1.15-1) ...
Processing triggers for sgml-base (1.29.1) ...
Setting up docutils-common (0.16+dfsg-2) ...
Processing triggers for sgml-base (1.29.1) ...
Setting up python3-docutils (0.16+dfsg-2) ...
update-alternatives: using /usr/share/docutils/scripts/python3/rst-buildhtml to provide /usr/bin/rst-buildhtml (rst-buildhtml) in auto mode
update-alternatives: using /usr/share/docutils/scripts/python3/rst2html to provide /usr/bin/rst2html (rst2html) in auto mode
update-alternatives: using /usr/share/docutils/scripts/python3/rst2html4 to provide /usr/bin/rst2html4 (rst2html4) in auto mode
update-alternatives: using /usr/share/docutils/scripts/python3/rst2html5 to provide /usr/bin/rst2html5 (rst2html5) in auto mode
update-alternatives: using /usr/share/docutils/scripts/python3/rst2latex to provide /usr/bin/rst2latex (rst2latex) in auto mode
update-alternatives: using /usr/share/docutils/scripts/python3/rst2man to provide /usr/bin/rst2man (rst2man) in auto mode
update-alternatives: using /usr/share/docutils/scripts/python3/rst2odt to provide /usr/bin/rst2odt (rst2odt) in auto mode
update-alternatives: using /usr/share/docutils/scripts/python3/rst2odt_prepstyles to provide /usr/bin/rst2odt_prepstyles (rst2odt_prepstyles) in auto mode
update-alternatives: using /usr/share/docutils/scripts/python3/rst2pseudoxml to provide /usr/bin/rst2pseudoxml (rst2pseudoxml) in auto mode
update-alternatives: using /usr/share/docutils/scripts/python3/rst2s5 to provide /usr/bin/rst2s5 (rst2s5) in auto mode
update-alternatives: using /usr/share/docutils/scripts/python3/rst2xetex to provide /usr/bin/rst2xetex (rst2xetex) in auto mode
update-alternatives: using /usr/share/docutils/scripts/python3/rst2xml to provide /usr/bin/rst2xml (rst2xml) in auto mode
update-alternatives: using /usr/share/docutils/scripts/python3/rstpep2html to provide /usr/bin/rstpep2html (rstpep2html) in auto mode
Setting up python3-botocore (1.16.19+repack-1ubuntu0.20.04.1) ...
Setting up python3-s3transfer (0.3.3-1) ...
Setting up awscli (1.18.69-1ubuntu0.20.04.1) ...
#+END_example

Install terraform:
#+begin_src shell
  curl -L -o terraform.zip https://releases.hashicorp.com/terraform/0.12.29/terraform_0.12.29_linux_amd64.zip

  unzip terraform.zip
  sudo mv terraform /usr/local/bin/terraform
#+end_src

#+RESULTS:
#+BEGIN_example
Archive:  terraform.zip
  inflating: terraform
#+END_example

Humacs:
#+begin_src shell
  git clone --recursive https://github.com/humacs/humacs
  cd humacs
  ./install.sh
#+end_src

Helm:
#+begin_src shell
  curl -L -o helm.tar.gz https://get.helm.sh/helm-v3.3.0-linux-amd64.tar.gz
  tar xvf helm.tar.gz
  sudo mv linux-amd64/helm /usr/local/bin/helm
  rm -r helm.tar.gz linux-amd64
#+end_src

#+RESULTS:
#+BEGIN_example
linux-amd64/
linux-amd64/README.md
linux-amd64/helm
linux-amd64/LICENSE
#+END_example

* Repos

Clone the repos we are working on:
#+begin_src shell :dir ~/
  git clone https://github.com/cncf-infra/prow-config
  git clone https://github.com/kubernetes/test-infra
#+end_src
